<?php

$tr = [
    'А' => 'A',
    'В' => 'B',
    'Е' => 'E',
    'І' => 'I',
    'К' => 'K',
    'М' => 'M',
    'Н' => 'H',
    'О' => 'O',
    'Р' => 'P',
    'С' => 'C',
    'Т' => 'T',
    'Х' => 'X',
    'а' => 'a',
    'е' => 'e',
    'і' => 'i',
    'о' => 'o',
    'р' => 'p',
    'с' => 'c',
    'у' => 'y',
    'х' => 'x',
];

// ABCDEFGHIJKLMNOPQRSTUVWXYZ
// abcdefghijklmnopqrstuvwxyz
// БГҐДЄЁЖЗИЇЙЛПУЎФЦЧШЩЪЫЬЭЮЯ
// бвгґдєёжзиїйклмнптўфцчшщъыьэюя

// Абетки різними мовами:
// UK: А Б В Г Ґ Д Е Є   Ж З И І Ї Й К Л М Н О П Р С Т У   Ф Х Ц Ч Ш Щ     Ь   Ю Я
// BE: А Б В Г Ґ Д Е   Ё Ж З   І   Й К Л М Н О П Р С Т У Ў Ф X Ц Ч Ш     Ы Ь Э Ю Я
// RU: А Б В Г   Д Е   Ё Ж З И     Й К Л М Н О П Р С Т У   Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я

// Можливий варіант сортування:
// XX: А Б В Г Ґ Д Е Є Ё Ж З И І Ї Й К Л М Н О П Р С Т У Ў Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
//     а б в г ґ д е є ё ж з и і ї й к л м н о п р с т у ў ф х ц ч ш щ ъ ы ь э ю я

////////////////////////////////////////////////////////////////////////

// WTF
// strlen('ABCDEFGHKLNOPQRSUZ') = 18
// strlen('MTVWXY') = 6
// strlen('IJ') = 2
// 18*5 + 6*6 + 2*4 - 1 = 133
